Конфигурация/DataProcessors/СводноеПогашениеОблигации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СводноеПогашениеОблигации</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/КупонныйДоходПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КупонныйДоходПоОблигациям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияКупона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупонаВВалютеОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаОпределена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НоминалыЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НоминалыЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиНоминал</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроцентОтНачальногоНоминала</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИзменения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиНоминал</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиЦенныхБумагЗаблокированные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦенныхБумагЗаблокированные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидБлокировкиАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБлокировокАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Записан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомеченНаУдаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СписаниеЦеннойБумаги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СписаниеЦеннойБумаги</Name>
			<BasedOn>
				<xr:Item>Document.ПогашениеЦеннойБумаги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумагЗаблокированные</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиПогашаемые</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/DataProcessors/СводноеПогашениеОблигации/Forms/Основная/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// начальное заполнение формы
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ПогашениеОблигации) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры.ПогашениеОблигации);
	Иначе
		ЭтаФорма.Организация  = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		ЭтаФорма.Дата         = ТекущаяДата();
		ЭтаФорма.ДатаФиксации = ТекущаяДата();
	КонецЕсли;

	ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Облигация, "ВалютаНоминала");
	
	ЗаполнитьПлановыеИСозданныеПогашенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СводноеПогашениеЦеннойБумаги.Обновить" Тогда
		ЗаполнитьПлановыеИСозданныеПогашенияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ВидПогашенияОблигацииПриИзменении(Элемент)
	
	ВедущиеРеквизитыШапкиПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОблигацияПриИзменении(Элемент)
	
	ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Облигация, "ВалютаНоминала");
	ВедущиеРеквизитыШапкиПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЭтаФорма.ДатаФиксации <> ЭтаФорма.Дата Тогда
		Если Вопрос("Установить дату фиксации равную выбранной дате?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЭтаФорма.ДатаФиксации = ЭтаФорма.Дата;
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.СуммаНаОднуОблигацию = ПолучитьСуммуНаОднуОблигацию(ЭтаФорма.Облигация, ЭтаФорма.Дата, ЭтаФорма.ВидПогашения);
	
	ЗаполнитьПлановыеИСозданныеПогашенияНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаФиксацииПриИзменении(Элемент)
	
	ЗаполнитьПлановыеИСозданныеПогашенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНаОднуОблигациюПриИзменении(Элемент)
	
	Для каждого СтрокаПогашенияПлановые Из ЭтаФорма.ПогашенияПлановые Цикл
		СтрокаПогашенияПлановые.Сумма = СтрокаПогашенияПлановые.Количество * ЭтаФорма.СуммаНаОднуОблигацию;
	КонецЦикла;
	
	ОбновитьНадписьПогашенияПлановыеИтого(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКупонаНаОднуОблигациюПриИзменении(Элемент)

	Для каждого СтрокаПогашенияПлановые Из ЭтаФорма.ПогашенияПлановые Цикл
		СтрокаПогашенияПлановые.СуммаКупона = СтрокаПогашенияПлановые.Количество * ЭтаФорма.СуммаКупонаНаОднуОблигацию;
	КонецЦикла;
	
	ОбновитьНадписьПогашенияПлановыеИтого(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПогашенияСозданныеПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ПогашенияСозданные.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ТекущиеДанные.Документ);
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗаполнитьДатуФиксацииИзДаты(Команда)
	
	ЭтаФорма.ДатаФиксации = ЭтаФорма.Дата;
	
	ДатаФиксацииПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПогашенияПлановыеУстановитьВсеФлажки(Команда)
	
	Для каждого СтрокаПогашенияПлановые Из ЭтаФорма.ПогашенияПлановые Цикл
		СтрокаПогашенияПлановые.Флажок = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПогашенияПлановыеСнятьВсеФлажки(Команда)
	
	Для каждого СтрокаПогашенияПлановые Из ЭтаФорма.ПогашенияПлановые Цикл
		СтрокаПогашенияПлановые.Флажок = Ложь;
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	КлючиРазвернутыхСтрокПогашенияСозданные = Неопределено;
	РаботаСФормамиКлиент.ПолучитьКлючиРазвернутыхСтрокДерева(ЭтаФорма.ПогашенияСозданные, Элементы.ПогашенияСозданные, "Документ", КлючиРазвернутыхСтрокПогашенияСозданные);
	
	КлючТекущейСтрокиПогашенияСозданные = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.ПогашенияСозданные, "Документ");
	КлючТекущейСтрокиПогашенияПлановые  = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.ПогашенияПлановые,  "СчетДоверительногоУправления");
	
	ЗаполнитьПлановыеИСозданныеПогашенияНаСервере();
	
	РаботаСФормамиКлиент.ВосстановитьРазвернутыеСтрокиДереваПоКлючу(ЭтаФорма.ПогашенияСозданные, Элементы.ПогашенияСозданные, "Документ", КлючиРазвернутыхСтрокПогашенияСозданные);
	
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.ПогашенияСозданные, Элементы.ПогашенияСозданные, "Документ", КлючТекущейСтрокиПогашенияСозданные);
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.ПогашенияПлановые, Элементы.ПогашенияПлановые, "СчетДоверительногоУправления", КлючТекущейСтрокиПогашенияСозданные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьПогашенияОблигации(Команда)
	
	ЕстьОшибки = Ложь;
	
	// проверим заполнение
	ВыбПлановыеПогашения = Новый Массив();
	
	Для НомСтр = 0 По ЭтаФорма.ПогашенияПлановые.Количество() - 1 Цикл
			
		СтрокаПлановыеПогашения = ЭтаФорма.ПогашенияПлановые[НомСтр];
		
		Если Не СтрокаПлановыеПогашения.Флажок Тогда
			Продолжить;
		КонецЕсли;
	
		Если СтрокаПлановыеПогашения.Количество = 0 Тогда
			Сообщить("Не заполнено поле ""Количество"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если СтрокаПлановыеПогашения.Сумма = 0 Тогда
			Сообщить("Не заполнено поле ""Сумма"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		ВыбПлановыеПогашения.Добавить(
			Новый Структура("СчетДоверительногоУправления, Количество, Сумма, СуммаКупона",
				СтрокаПлановыеПогашения.СчетДоверительногоУправления,
				СтрокаПлановыеПогашения.Количество,
				СтрокаПлановыеПогашения.Сумма,
				СтрокаПлановыеПогашения.СуммаКупона));
		
	КонецЦикла;
	
	Если      ЕстьОшибки Тогда
		Возврат;
	ИначеЕсли ВыбПлановыеПогашения.Количество() = 0 Тогда
		Сообщить("Не выбраны плановые погашения.");
		Возврат;
	КонецЕсли;
	
	// откроем форму
	ПараметрыФормы = Новый Структура("ПлановыеПогашения, Организация, ВидПогашения, Облигация, Дата, ДатаФиксации", ВыбПлановыеПогашения);
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ЭтаФорма);
	
	Если ОткрытьФормуМодально("Обработка.СводноеПогашениеОблигации.Форма.СозданиеПогашенийОблигации", ПараметрыФормы, ЭтаФорма) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыПровести(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
		
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда
		
		РаботаСоСпискомДокументовКлиент.Провести(ДанныеВыбранныхДокументов);
	
		КомандаОбновить(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыОтменитьПроведение(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
	
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда
		
		РаботаСоСпискомДокументовКлиент.ОтменитьПроведение(ДанныеВыбранныхДокументов);
		
		КомандаОбновить(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыУстановитьСнятьПометкуУдаление(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
	
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда		
		
		Попытка 
			РаботаСоСпискомДокументовКлиент.УстановитьСнятьПометкуУдаления(ДанныеВыбранныхДокументов);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить/снять пометку удаления у выбранных документов: " + ОписаниеОшибки());
		КонецПопытки;
		
		КомандаОбновить(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыСоздатьНаОсновании(Команда)
	
	ТекущиеДанныеСписка = Элементы.ПогашенияСозданные.ТекущиеДанные;
	
	Если ТекущиеДанныеСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанныеСписка.Документ) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") Тогда
		
		РаботаСоСпискомДокументовКлиент.СоздатьНаОсновании(ТекущиеДанныеСписка.Документ, "ПогашениеЦеннойБумаги");
		
		КомандаОбновить(Неопределено);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьНедостающиеОплаты(Команда)
	
	ПогашенияОблигации = Новый Массив();
	
	Для каждого Элемент Из ЭтаФорма.ПогашенияСозданные.ПолучитьЭлементы() Цикл
		ПогашенияОблигации.Добавить(Элемент.Документ);
	КонецЦикла;
	
	Если ПогашенияОблигации.Количество() > 0 Тогда
		
		ДатаОплат = ?(ДатаФиксации < ТекущаяДата(), ТекущаяДата(), ДатаФиксации + 34*3600);
		
		Если Не ВвестиДату(ДатаОплат, "Введите дату оплат", ЧастиДаты.ДатаВремя) Тогда
			Возврат;
		КонецЕсли;
		
		СоздатьНедостающиеОплатыПоПогашениямОблигации(ДатаОплат, ЭтаФорма.Организация, РаботаСЦеннымиБумагами.КонтрагентПоЦеннойБумаге(ЭтаФорма.Облигация), ПогашенияОблигации);
		
		КомандаОбновить(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьНедостающиеСписанияОблигаций(Команда)
	
	ПогашенияОблигации = Новый Массив();
	
	Для каждого Элемент Из ЭтаФорма.ПогашенияСозданные.ПолучитьЭлементы() Цикл
		ПогашенияОблигации.Добавить(Элемент.Документ);
	КонецЦикла;
	
	Если ПогашенияОблигации.Количество() > 0 Тогда
		
		ДатаСписания = ?(ДатаФиксации < ТекущаяДата(), ТекущаяДата(), ДатаФиксации + 34*3600);
		
		Если Не ВвестиДату(ДатаСписания, "Введите дату списания", ЧастиДаты.ДатаВремя) Тогда
			Возврат;
		КонецЕсли;
		
		СоздатьНедостающиеСписанияПоПогашениямОблигации(ДатаСписания, ЭтаФорма.Организация, ЭтаФорма.Облигация, ПогашенияОблигации);
		
		КомандаОбновить(Неопределено);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПогашенияСозданныеРазвернутьВсе(Команда)
	
	РаботаСФормамиКлиент.РазвернутьВсеЭлементыДерева(ЭтаФорма.ПогашенияСозданные, Элементы.ПогашенияСозданные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПогашенияСозданныеСвернутьВсе(Команда)
	
	РаботаСФормамиКлиент.СвернутьВсеЭлементыДерева(ЭтаФорма.ПогашенияСозданные, Элементы.ПогашенияСозданные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьГрафикНачисленияПроцентов(Команда)
	
	ПараметрыФормы = Новый Структура("Отбор",
		Новый Структура("Облигация", ЭтаФорма.Облигация));
	
	ОткрытьФорму("РегистрСведений.КупонныйДоходПоОблигациям.ФормаСписка", ПараметрыФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьГрафикИзмененияНоминала(Команда)
	
	ПараметрыФормы = Новый Структура("Отбор",
		Новый Структура("ЦеннаяБумага", ЭтаФорма.Облигация));
	
	ОткрытьФорму("РегистрСведений.НоминалыЦенныхБумаг.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьУсловияОферт(Команда)
	
	ПараметрыФормы = Новый Структура("Отбор",
		Новый Структура("Облигация", ЭтаФорма.Облигация));
	
	ОткрытьФорму("РегистрСведений.УсловияОферт.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПоручениеНаСделкуГПБ(Команда)
	БрокерГПБ=ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ");//ГПБ
	ПечатьПоручения("Поручение по ГПБ",БрокерГПБ);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьНамерениеПродатьГПБ(Команда)
	БрокерГПБ=ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ");//ГПБ
	ПечатьПоручения("Намерение продать по ГПБ",БрокерГПБ);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменаПорученияБКРегион(Команда)
	БрокерБК=ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион");//БК РЕГИОН
	ПечатьПоручения("Отмена поручения БК Регион",БрокерБК);

КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьПорученияБКРегион(Команда)
	БрокерБК=ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион");//БК РЕГИОН
	ПечатьПоручения("Поручение БК Регион",БрокерБК);
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ВедущиеРеквизитыШапкиПриИзменении()

	Если ЗначениеЗаполнено(ЭтаФорма.Облигация) И ЭтаФорма.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.ЧастичноеПогашение")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Облигация, "Амортизационная") = Ложь
	Тогда
		Сообщить("При частичном погашении можно выбирать только амортизационные облигации");
		ЭтаФорма.Облигация = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	Элементы.Дата.СписокВыбора.Очистить();
	
	Если      ЭтаФорма.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.ПолноеПогашение") Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.Облигация) Тогда
			ЭтаФорма.Дата         = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Облигация, "ДатаПогашения");
			ДатаФиксацииДляПогашения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Облигация, "ДатаФиксацииДляПогашения");
			Если ЗначениеЗаполнено(ДатаФиксацииДляПогашения) Тогда
				ЭтаФорма.ДатаФиксации = ДатаФиксацииДляПогашения;
			Иначе	
				ЭтаФорма.ДатаФиксации = ЭтаФорма.Дата;
			КонецЕсли;	
		Иначе
			ЭтаФорма.Дата         = Неопределено;
		КонецЕсли;
		
		Элементы.ПогашенияПлановыеБрокер.Видимость				= Ложь;
				
	ИначеЕсли ЭтаФорма.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.Оферта") Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.Облигация) Тогда
		
			ПодходящаяДата = Неопределено;
			
			МассивДатУсловий = ПолучитьДатыУсловийОферт(ЭтаФорма.Облигация, ПодходящаяДата);
			Для каждого ДатаУсловий Из МассивДатУсловий Цикл
				Элементы.Дата.СписокВыбора.Добавить(ДатаУсловий, Формат(ДатаУсловий, "ДФ=dd.MM.yyyy"));
			КонецЦикла; 
				
			Если ЭтаФорма.Дата <> ПодходящаяДата
				И Вопрос("Изменить дату и дату фиксации на " + Формат(ПодходящаяДата, "ДФ=dd.MM.yyyy") + " из графика условий оферт?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да
			Тогда
				ЭтаФорма.Дата         = ПодходящаяДата;
				ЭтаФорма.ДатаФиксации = ПодходящаяДата;
				ЭтаФорма.СуммаНаОднуОблигацию = ПолучитьСуммуНаОднуОблигацию(Облигация, ПодходящаяДата, ВидПогашения);
			КонецЕсли;
			
		КонецЕсли;
		
		Элементы.ПогашенияПлановыеБрокер.Видимость				= Истина;
		
	ИначеЕсли ЭтаФорма.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.ЧастичноеПогашение") Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.Облигация) Тогда
		
			ПодходящаяДата = Неопределено;
			
			МассивДатГрафика = ПолучитьДатыИзмененияНоминала(ЭтаФорма.Облигация, ПодходящаяДата);
			Для каждого ДатаГрафика Из МассивДатГрафика Цикл
				Элементы.Дата.СписокВыбора.Добавить(ДатаГрафика, Формат(ДатаГрафика, "ДФ=dd.MM.yyyy"));
			КонецЦикла;
			
			Если ЭтаФорма.Дата <> ПодходящаяДата
				И Вопрос("Изменить дату и дату фиксации на " + Формат(ПодходящаяДата, "ДФ=dd.MM.yyyy") + " из графика изменения номинала?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да
			Тогда
				ЭтаФорма.Дата         = ПодходящаяДата;
				ЭтаФорма.ДатаФиксации = ПодходящаяДата;
			КонецЕсли;
			
		КонецЕсли;
		
		ЭтаФорма.СуммаКупонаНаОднуОблигацию 					= 0;
		Элементы.ПогашенияПлановыеБрокер.Видимость				= Ложь;
		
	КонецЕсли;
	
	ЭтаФорма.СуммаНаОднуОблигацию = ПолучитьСуммуНаОднуОблигацию(ЭтаФорма.Облигация, ЭтаФорма.Дата, ЭтаФорма.ВидПогашения);
		
	ЗаполнитьПлановыеИСозданныеПогашенияНаСервере();

КонецПроцедуры // ВедущиеРеквизитыШапкиПриИзменении

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписьПогашенияПлановыеИтого(Форма)
	
	ТекстНадписи = "";
	
	Если Форма.ПогашенияПлановые.Количество() > 0 Тогда
		
		ИтогоКоличество  = 0;
		ИтогоСумма       = 0;
		ИтогоСуммаКупона = 0;
		
		Для каждого СтрокаПогашенияПлановые Из Форма.ПогашенияПлановые Цикл
			ИтогоКоличество  = ИтогоКоличество  + СтрокаПогашенияПлановые.Количество;
			ИтогоСумма       = ИтогоСумма       + СтрокаПогашенияПлановые.Сумма;
			ИтогоСуммаКупона = ИтогоСуммаКупона + СтрокаПогашенияПлановые.СуммаКупона;
		КонецЦикла;
		
		ТекстНадписи = "Итого " + ИтогоКоличество + " " + РаботаСКорзинойЦенныхБумагКлиентСервер.ФормаМножественногоЧислаЦеннойБумаги(ИтогоКоличество, ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"))
			+ " на сумму " + ИтогоСумма + ?(ИтогоСуммаКупона > 0, ", сумма купона " + ИтогоСуммаКупона, "");
		
	КонецЕсли;
	
	Форма.Элементы.НадписьПогашенияПлановыеИтого.Заголовок = ТекстНадписи;
	
КонецПроцедуры // ОбновитьНадписьПогашенияПлановыеИтого

&НаСервереБезКонтекста
Процедура СоздатьНедостающиеОплатыПоПогашениямОблигации(Период, Организация, Контрагент, ПогашенияОблигации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Период КАК Дата,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход) КАК ВидДвижения,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК ВалютаОплаты,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Организация,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.Брокер КАК Брокер,
		|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок) КАК МестоХранения,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.РасчетныйСчет КАК РасчетныйСчет,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание,
		|	&Контрагент,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК Сумма,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК СуммаКупона,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК СуммаОплатыКупона
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			,
		|			Организация = &Организация
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				И Основание В (&Основание)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|ГДЕ
		|	(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток > 0
		|			ИЛИ ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток > 0)";
		
	Запрос.УстановитьПараметр("Период",			Период);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);
	Запрос.УстановитьПараметр("Основание",		ПогашенияОблигации);
		
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Выборка.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создание оплат не требуется");
		Возврат;
		
	КонецЕсли; 
	
	Пока Выборка.Следующий() Цикл
		
		Документ = Документы.Оплата.СоздатьДокумент();
		
		Документ.Ответственный = РаботаСПользователями.ТекущийПользователь();
			
		ЗаполнитьЗначенияСвойств(Документ, Выборка);
		ЗаполнитьЗначенияСвойств(Документ.Основания.Добавить(), Выборка);
		
		Если Не Документ.ПроверитьЗаполнение() Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + Документ.Ссылка, Документ.Ссылка);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры // СоздатьНедостающиеОплатыПоПогашениямОблигации

&НаСервереБезКонтекста
Процедура СоздатьНедостающиеСписанияПоПогашениямОблигации(Период, Организация, Облигация, ПогашенияОблигации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПогашениеЦеннойБумаги.Ссылка КАК Ссылка,
		|	ПогашениеЦеннойБумаги.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПогашениеЦеннойБумаги.Количество КАК Количество
		|ПОМЕСТИТЬ _ПогашенияОблигации
		|ИЗ
		|	Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|ГДЕ
		|	ПогашениеЦеннойБумаги.Ссылка В(&ПогашенияОблигации)
		|	И ПогашениеЦеннойБумаги.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Период КАК Дата,
		|	ОстаткиЦенныхБумагЗаблокированные.Организация КАК Организация,
		|	ОстаткиЦенныхБумагЗаблокированные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагЗаблокированные.Рынок КАК Рынок,
		|	ОстаткиЦенныхБумагЗаблокированные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагЗаблокированные.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	ОстаткиЦенныхБумагЗаблокированные.КоличествоОстаток КАК Количество,
		|	_ПогашенияОблигации.Ссылка КАК ПогашениеЦеннойБумаги,
		|	_ПогашенияОблигации.Количество КАК КоличествоВПогашении
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные.Остатки(
		|			&ПериодГраница,
		|			Организация = &Организация
		|				И ВидБлокировкиАктива = ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагЗаблокированные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПогашенияОблигации КАК _ПогашенияОблигации
		|		ПО ОстаткиЦенныхБумагЗаблокированные.СчетДоверительногоУправления = _ПогашенияОблигации.СчетДоверительногоУправления";
		
	Запрос.УстановитьПараметр("Период",				Период);
	Запрос.УстановитьПараметр("ПериодГраница",		Новый Граница(КонецДня(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ЦеннаяБумага",		Облигация);
	Запрос.УстановитьПараметр("ПогашенияОблигации",	ПогашенияОблигации);
		
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Выборка.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создание списаний не требуется");
		Возврат;
		
	КонецЕсли; 
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество <> Выборка.КоличествоВПогашении Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество заблокированных ценных бумаг " + Выборка.Количество + " по счету д/у '"
					+ Выборка.СчетДоверительногоУправления + "' не совпадает с количеством " + Выборка.КоличествоВПогашении + " в погашении. Создание такого списания ц/б временно не поддерживается", Выборка.ПогашениеЦеннойБумаги);
			Продолжить;
		КонецЕсли;
		
		Документ = Документы.СписаниеЦеннойБумаги.СоздатьДокумент();
		
		Документ.Ответственный = РаботаСПользователями.ТекущийПользователь();
			
		ЗаполнитьЗначенияСвойств(Документ, Выборка);
		
		Если Не Документ.ПроверитьЗаполнение() Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + Документ.Ссылка, Документ.Ссылка);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		 
	КонецЦикла;
	
КонецПроцедуры // СоздатьНедостающиеСписанияПоПогашениямОблигации

&НаСервереБезКонтекста
Функция ПолучитьДатыИзмененияНоминала(Облигация, ПодходящаяДата = Неопределено)
	
	ПодходящаяДата       = Дата(1, 1, 1);
	ТекущаяДатаНачалоДня = НачалоДня(ТекущаяДата());
	
	ДатыИзмененияНоминала = Новый Массив();
	
	Если ЗначениеЗаполнено(Облигация) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НоминалыЦенныхБумаг.Период КАК Период
			|ИЗ
			|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
			|ГДЕ
			|	НоминалыЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
			
		Запрос.УстановитьПараметр("ЦеннаяБумага", Облигация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДатыИзмененияНоминала.Добавить(Выборка.Период);
			
			Если Выборка.Период <= ТекущаяДатаНачалоДня Тогда
				ПодходящаяДата = Выборка.Период;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДатыИзмененияНоминала;
	
КонецФункции // ПолучитьДатыИзмененияНоминала

&НаСервереБезКонтекста
Функция ПолучитьДатыУсловийОферт(Облигация, ПодходящаяДата = Неопределено)
	
	ПодходящаяДата       = Дата(1, 1, 1);
	ТекущаяДатаНачалоДня = НачалоДня(ТекущаяДата());
	
	ДатыИзмененияУсловийОферт = Новый Массив();
	
	Если ЗначениеЗаполнено(Облигация) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияОферт.ДатаВыкупа
			|ИЗ
			|	РегистрСведений.УсловияОферт КАК УсловияОферт
			|ГДЕ
			|	УсловияОферт.Облигация = &Облигация
			|
			|УПОРЯДОЧИТЬ ПО
			|	УсловияОферт.ДатаВыкупа";
			
		Запрос.УстановитьПараметр("Облигация", Облигация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДатыИзмененияУсловийОферт.Добавить(Выборка.ДатаВыкупа);
			
			Если Выборка.ДатаВыкупа <= ТекущаяДатаНачалоДня Тогда
				ПодходящаяДата = Выборка.ДатаВыкупа;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДатыИзмененияУсловийОферт;
	
КонецФункции // ПолучитьДатыУсловийОферт

&НаСервереБезКонтекста
Функция ПолучитьСуммуНаОднуОблигацию(Облигация, Период, ВидПогашения)
	
	Если ВидПогашения = Перечисления.ВидыПогашения.ПолноеПогашение
			Или ВидПогашения = Перечисления.ВидыПогашения.ЧастичноеПогашение
	Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫРАЗИТЬ(НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага КАК Справочник.Облигации).Амортизационная КАК Амортизационная,
			|	НоминалыЦенныхБумагСрезПоследних.Номинал,
			|	НоминалыЦенныхБумагСрезПоследних.СуммаИзменения
			|ИЗ
			|	РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ЦеннаяБумага = &ЦеннаяБумага) КАК НоминалыЦенныхБумагСрезПоследних";
			
		Запрос.УстановитьПараметр("ЦеннаяБумага", Облигация);
		Запрос.УстановитьПараметр("Период",       Период);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если ВидПогашения = Перечисления.ВидыПогашения.ПолноеПогашение Тогда
				// когда-то давно для амортизационных облигаций в номиналах фиксировалось последнее погашение
				// и сумму нужно было брать из суммы изменения, но те времена канули в лету
				Возврат Выборка.Номинал; 
			ИначеЕсли ВидПогашения = Перечисления.ВидыПогашения.ЧастичноеПогашение Тогда
				Возврат Выборка.СуммаИзменения;
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ВидПогашения = Перечисления.ВидыПогашения.Оферта Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НоминалыЦенныхБумагСрезПоследних.Номинал,
			|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
			|ПОМЕСТИТЬ ТекущийНоминал
			|ИЗ
			|	РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ЦеннаяБумага = &ЦеннаяБумага) КАК НоминалыЦенныхБумагСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ТекущийНоминал.Номинал, 0) * УсловияОферт.ЦенаПроцент / 100 КАК СуммаНаОднуОблигацию
			|ИЗ
			|	РегистрСведений.УсловияОферт КАК УсловияОферт
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущийНоминал КАК ТекущийНоминал
			|		ПО УсловияОферт.Облигация = ТекущийНоминал.ЦеннаяБумага
			|ГДЕ
			|	УсловияОферт.Облигация = &ЦеннаяБумага
			|	И УсловияОферт.ДатаВыкупа = &Период";
		
		Запрос.УстановитьПараметр("Период", 		Период);
		Запрос.УстановитьПараметр("ЦеннаяБумага", 	Облигация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.СуммаНаОднуОблигацию;
		Иначе
			Возврат 0;
		КонецЕсли;		
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции // ПолучитьСуммыНаОднуОблигацию

&НаСервере
Функция ЗаполнитьСозданныеПогашенияОблигацииНаСервере()
	
	ПогашенияСозданные.ПолучитьЭлементы().Очистить();
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Облигация) Или Не ЗначениеЗаполнено(ЭтаФорма.ВидПогашения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПогашенияСозданныеНаСервере = РеквизитФормыВЗначение("ПогашенияСозданные");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПогашениеЦеннойБумаги.Ссылка КАК Документ,
		|	ВЫБОР
		|		КОГДА ПогашениеЦеннойБумаги.Проведен
		|			ТОГДА 1
		|		КОГДА ПогашениеЦеннойБумаги.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СостояниеДокумента,
		|	ВЫБОР
		|		КОГДА ПогашениеЦеннойБумаги.ПометкаУдаления
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИсключатьИзРасчетов,
		|	ПогашениеЦеннойБумаги.СчетДоверительногоУправления,
		|	ПогашениеЦеннойБумаги.СчетДоверительногоУправления КАК Объект,
		|	ПогашениеЦеннойБумаги.Брокер,
		|	ПогашениеЦеннойБумаги.РасчетныйСчет,
		|	ПогашениеЦеннойБумаги.Количество,
		|	ПогашениеЦеннойБумаги.Сумма,
		|	ПогашениеЦеннойБумаги.СуммаКупона,
		|	ПогашениеЦеннойБумаги.ВалютаОплаты
		|ИЗ
		|	Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|ГДЕ
		|	ПогашениеЦеннойБумаги.Организация = &Организация
		|	И ПогашениеЦеннойБумаги.ЦеннаяБумага = &Облигация
		|	И НАЧАЛОПЕРИОДА(ПогашениеЦеннойБумаги.Дата, ДЕНЬ) = &Дата
		|	И ПогашениеЦеннойБумаги.ДатаФиксации = &ДатаФиксации
		|	И ПогашениеЦеннойБумаги.ВидПогашения = &ВидПогашенияОблигации";
		
	Запрос.УстановитьПараметр("Организация",           ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("Облигация",             ЭтаФорма.Облигация);
	Запрос.УстановитьПараметр("Дата",                  ЭтаФорма.Дата);
	Запрос.УстановитьПараметр("ДатаФиксации",          ЭтаФорма.ДатаФиксации);
	Запрос.УстановитьПараметр("ВидПогашенияОблигации", ЭтаФорма.ВидПогашения);
	
	ПогашенияОблигации = Запрос.Выполнить().Выгрузить();
	
	// получим и перенесем на форму погашения облигаций с оплатами
	ОбработанныеПогашения = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОплатаОснования.Основание КАК ПогашениеЦеннойБумаги,
		|	ОплатаОснования.Ссылка КАК Документ,
		|	ОплатаОснования.Ссылка КАК Объект,
		|	ВЫБОР
		|		КОГДА ОплатаОснования.Ссылка.Проведен
		|			ТОГДА 1
		|		КОГДА ОплатаОснования.Ссылка.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СостояниеДокумента,
		|	ОплатаОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОплатаОснования.Ссылка.ВалютаОплаты КАК ВалютаОплаты,
		|	ОплатаОснования.Ссылка.Брокер КАК Брокер,
		|	ОплатаОснования.Ссылка.РасчетныйСчет КАК РасчетныйСчет,
		|	ОплатаОснования.Сумма КАК Сумма,
		|	ОплатаОснования.СуммаКупона КАК СуммаКупона,
		|	0 КАК Количество
		|ИЗ
		|	Документ.Оплата.Основания КАК ОплатаОснования
		|ГДЕ
		|	ОплатаОснования.Ссылка.Организация = &Организация
		|	И ОплатаОснования.Основание В(&ПогашенияОблигации)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеЦеннойБумаги.ПогашениеЦеннойБумаги,
		|	СписаниеЦеннойБумаги.Ссылка,
		|	СписаниеЦеннойБумаги.Ссылка,
		|	ВЫБОР
		|		КОГДА СписаниеЦеннойБумаги.Проведен
		|			ТОГДА 1
		|		КОГДА СписаниеЦеннойБумаги.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ,
		|	СписаниеЦеннойБумаги.СчетДоверительногоУправления,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	0,
		|	СписаниеЦеннойБумаги.Количество
		|ИЗ
		|	Документ.СписаниеЦеннойБумаги КАК СписаниеЦеннойБумаги
		|ГДЕ
		|	СписаниеЦеннойБумаги.Организация = &Организация
		|	И СписаниеЦеннойБумаги.ПогашениеЦеннойБумаги В(&ПогашенияОблигации)
		|ИТОГИ ПО
		|	ПогашениеЦеннойБумаги";
	
	Запрос.УстановитьПараметр("Организация",        ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("ПогашенияОблигации", ПогашенияОблигации.ВыгрузитьКолонку("Документ"));
		
	ВыборкаПогашенияОблигации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПогашенияОблигации.Следующий() Цикл
		
		// найдем соответствующее погашение купона
		СтрокаПогашениеЦеннойБумаги = ПогашенияОблигации.Найти(ВыборкаПогашенияОблигации.ПогашениеЦеннойБумаги, "Документ");
		
		Если СтрокаПогашениеЦеннойБумаги = Неопределено Тогда // такого быть не должно, но на всякий случай отработаем
			Сообщить("Ошибка заполнения фактических погашений. Не удалось получить реквизиты документа " + ВыборкаПогашенияОблигации.ПогашениеЦеннойБумаги + ". Обратитесь к разработчикам.");
			Продолжить;
		КонецЕсли;	
			
		ПогашенияСозданныеНаСервереСтрока1 = ПогашенияСозданныеНаСервере.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(ПогашенияСозданныеНаСервереСтрока1, СтрокаПогашениеЦеннойБумаги);
		
		ПогашенияСозданныеНаСервереСтрока1.ПлатежныеРеквизиты = ""
			+ ?(ЗначениеЗаполнено(ПогашенияСозданныеНаСервереСтрока1.Брокер), "брокер " + ПогашенияСозданныеНаСервереСтрока1.Брокер + ", ", "")
			+ ?(ЗначениеЗаполнено(ПогашенияСозданныеНаСервереСтрока1.РасчетныйСчет), "р/счет " + ПогашенияСозданныеНаСервереСтрока1.РасчетныйСчет, "");
		
		ВыборкаОплаты = ВыборкаПогашенияОблигации.Выбрать();
		
		Пока ВыборкаОплаты.Следующий() Цикл
			
			ПогашенияСозданныеНаСервереСтрока2 = ПогашенияСозданныеНаСервереСтрока1.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(ПогашенияСозданныеНаСервереСтрока2, ВыборкаОплаты);
			
			ПогашенияСозданныеНаСервереСтрока2.ПлатежныеРеквизиты = ""
				+ ?(ЗначениеЗаполнено(ПогашенияСозданныеНаСервереСтрока2.Брокер), "брокер " + ПогашенияСозданныеНаСервереСтрока2.Брокер + ", ", "")
				+ ?(ЗначениеЗаполнено(ПогашенияСозданныеНаСервереСтрока2.РасчетныйСчет), "р/счет " + ПогашенияСозданныеНаСервереСтрока2.РасчетныйСчет, "");
			
		КонецЦикла;
			
		ОбработанныеПогашения.Добавить(ВыборкаПогашенияОблигации.ПогашениеЦеннойБумаги);
		
	КонецЦикла;
	
	// перенесем на форму погашения облигаций без оплат
	Для каждого СтрокаПогашенияОблигации Из ПогашенияОблигации Цикл
		
		Если ОбработанныеПогашения.Найти(СтрокаПогашенияОблигации.Документ) = Неопределено Тогда
			
			ПогашенияСозданныеНаСервереСтрока1 = ПогашенияСозданныеНаСервере.Строки.Добавить();
			
			ЗаполнитьЗначенияСвойств(ПогашенияСозданныеНаСервереСтрока1, СтрокаПогашенияОблигации);
			
			ПогашенияСозданныеНаСервереСтрока1.ПлатежныеРеквизиты = ""
				+ ?(ЗначениеЗаполнено(ПогашенияСозданныеНаСервереСтрока1.Брокер), "брокер " + ПогашенияСозданныеНаСервереСтрока1.Брокер + ", ", "")
				+ ?(ЗначениеЗаполнено(ПогашенияСозданныеНаСервереСтрока1.РасчетныйСчет), "р/счет " + ПогашенияСозданныеНаСервереСтрока1.РасчетныйСчет, "");
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ПогашенияСозданныеНаСервере, "ПогашенияСозданные");
	
КонецФункции // ЗаполнитьСозданныеПогашенияОблигацииНаСервере

&НаСервере
Функция ЗаполнитьПлановыеПогашенияНаСервере()
	
	ПогашенияПлановые.Очистить();
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Облигация) Или Не ЗначениеЗаполнено(ЭтаФорма.ВидПогашения) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	// описание запроса. 
	// поле ТолькоДляФизическихЛиц - сделана избыточность на тот случай если дата погашения частичного или полного совпадет с датой оферты
	// ТолькоДляФизическихЛиц будет одинаковым для всех записей, для не оферты всегда будет ложь
	// Секция ГДЕ: если оферта для физлиц, выбираем только физические лица, иначе - все. 

	// плановые данные
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Флажок,
		|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&Брокер,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) * &СуммаНаОднуОблигацию КАК Сумма,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) * &СуммаКупонаНаОднуОблигацию КАК СуммаКупона,
		|	ЕСТЬNULL(УсловияОферт.ТолькоДляФизическихЛиц, ЛОЖЬ) КАК ТолькоДляФизическихЛиц,
		|	ЕСТЬNULL(ЮрФизЛица.ВидЮрФизЛица, НЕОПРЕДЕЛЕНО) КАК ВидЮрФизЛица
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&ДатаФиксации,
		|			Организация = &Организация
		|				И ЦеннаяБумага = &Облигация) КАК ОстаткиЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ЦеннаяБумага = &Облигация) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям.СрезПоследних(&Период, Облигация = &Облигация) КАК КупонныйДоходПоОблигациямСрезПоследних
		|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = КупонныйДоходПоОблигациямСрезПоследних.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО (&ВидПогашенияОферта)
		|			И (УсловияОферт.Облигация = &Облигация)
		|			И (УсловияОферт.ДатаВыкупа = НАЧАЛОПЕРИОДА(&ДатаФиксации, ДЕНЬ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ЮрФизЛица.Ссылка
		|		ПО ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	(ЕСТЬNULL(УсловияОферт.ТолькоДляФизическихЛиц, ЛОЖЬ)
		|				И ЕСТЬNULL(ЮрФизЛица.ВидЮрФизЛица, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ИЛИ НЕ ЕСТЬNULL(УсловияОферт.ТолькоДляФизическихЛиц, ЛОЖЬ))";

	
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"&Брокер,",?(ВидПогашения = Перечисления.ВидыПогашения.Оферта,"ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.Брокер Как Брокер,",""));	
	Запрос.УстановитьПараметр("Период",                     КонецДня(ЭтаФорма.Дата));
	Запрос.УстановитьПараметр("ДатаФиксации",               ?(ЭтаФорма.ДатаФиксации = ЭтаФорма.Дата, НачалоДня(ЭтаФорма.ДатаФиксации), КонецДня(ЭтаФорма.ДатаФиксации)));
	Запрос.УстановитьПараметр("Организация",                ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("Облигация",               	ЭтаФорма.Облигация);
	Запрос.УстановитьПараметр("СуммаНаОднуОблигацию",       ЭтаФорма.СуммаНаОднуОблигацию);
	Запрос.УстановитьПараметр("СуммаКупонаНаОднуОблигацию", ЭтаФорма.СуммаКупонаНаОднуОблигацию);
	Запрос.УстановитьПараметр("ВидПогашенияОферта",			ЭтаФорма.ВидПогашения = Перечисления.ВидыПогашения.Оферта);
	
	ПлановыеПогашения = Запрос.Выполнить().Выгрузить();
	ПлановыеПогашения.Индексы.Добавить("СчетДоверительногоУправления");
	
	// в плановые погашения запись попадает только тогда, когда нет созданного (проведенного или записанного)
	// соответствующего погашения; остальные распределяются по созданным погашениям
	Для каждого СтрокаПогашенияСозданные Из ЭтаФорма.ПогашенияСозданные.ПолучитьЭлементы() Цикл
		
		// пропускаем погашения, помеченние на удаление
		Если СтрокаПогашенияСозданные.ИсключатьИзРасчетов Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиПлановыеПогашения = ПлановыеПогашения.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СтрокаПогашенияСозданные.СчетДоверительногоУправления));
				
		Если СтрокиПлановыеПогашения.Количество() = 1 Тогда
			
			СтрокаПлановыеПогашения = СтрокиПлановыеПогашения[0];
			
			ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПогашенияСозданные.Документ, "Дата");
			Если СтрокаПогашенияСозданные.Количество >= СтрокаПлановыеПогашения.Количество Тогда 				
				
				СтрокаПогашенияСозданные.ПлановоеКоличество  = СтрокаПлановыеПогашения.Количество;
				СтрокаПогашенияСозданные.ПлановаяСумма       = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаПлановыеПогашения.Сумма, ВалютаНоминала, ДатаДокумента, СтрокаПогашенияСозданные.ВалютаОплаты, ДатаДокумента);
				СтрокаПогашенияСозданные.ПлановаяСуммаКупона = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаПлановыеПогашения.СуммаКупона, ВалютаНоминала, ДатаДокумента, СтрокаПогашенияСозданные.ВалютаОплаты, ДатаДокумента);
				
				ПлановыеПогашения.Удалить(СтрокаПлановыеПогашения);
				
			Иначе
				
				СтрокаПогашенияСозданные.ПлановоеКоличество  = СтрокаПогашенияСозданные.Количество;
				СтрокаПогашенияСозданные.ПлановаяСумма       = СтрокаПлановыеПогашения.Сумма * СтрокаПогашенияСозданные.Количество / СтрокаПлановыеПогашения.Количество;
				СтрокаПогашенияСозданные.ПлановаяСумма = СтрокаПлановыеПогашения.Сумма * СтрокаПогашенияСозданные.Количество / СтрокаПлановыеПогашения.Количество;
				
				СтрокаПлановыеПогашения.Количество  = СтрокаПлановыеПогашения.Количество  - СтрокаПогашенияСозданные.ПлановоеКоличество;
				СтрокаПлановыеПогашения.Сумма       = СтрокаПлановыеПогашения.Сумма       - СтрокаПогашенияСозданные.ПлановаяСумма;
				СтрокаПлановыеПогашения.СуммаКупона = СтрокаПлановыеПогашения.СуммаКупона - СтрокаПогашенияСозданные.ПлановаяСуммаКупона;
				
				СтрокаПогашенияСозданные.ПлановаяСумма       = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаПогашенияСозданные.ПлановаяСумма, ВалютаНоминала, ДатаДокумента, СтрокаПогашенияСозданные.ВалютаОплаты, ДатаДокумента);
				СтрокаПогашенияСозданные.ПлановаяСуммаКупона = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаПогашенияСозданные.ПлановаяСумма, ВалютаНоминала, ДатаДокумента, СтрокаПогашенияСозданные.ВалютаОплаты, ДатаДокумента);
				
			КонецЕсли;
				
		ИначеЕсли СтрокиПлановыеПогашения.Количество() > 1 Тогда // такого быть не должно, но на всякий случай, перестрахуемся
			
			Сообщить("Ошибка распределения плановых показателей по фактическим операциям. Найдено более одной подходящей строки. Обратитесь к разработчикам.");
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	// распределим оставшиеся плановые значения
	ПогашенияСозданныеНаСервере = РеквизитФормыВЗначение("ПогашенияСозданные");
	
	Если ПлановыеПогашения.Количество() > 0 Тогда
		
		// сложность распределения в том, что плановые суммы могут закрываться разными документами
		// поэтому оставшуюся разницу закинем на первую попашуюся подходящую строку
		
		ПогашенияПлановыеНаСервере = РеквизитФормыВЗначение("ПогашенияПлановые");
				
		Для каждого СтрокаПлановыеПогашения Из ПлановыеПогашения Цикл
			
			СтрокиПогашенияСозданныеНаСервере = ПогашенияСозданныеНаСервере.Строки.НайтиСтроки(
				Новый Структура("СчетДоверительногоУправления", СтрокаПлановыеПогашения.СчетДоверительногоУправления));

			// исключим помеченные на удаление документы		
			Для Инд = 1 - СтрокиПогашенияСозданныеНаСервере.Количество() По 0 Цикл
				Если СтрокиПогашенияСозданныеНаСервере[-Инд].ИсключатьИзРасчетов Тогда
					СтрокиПогашенияСозданныеНаСервере.Удалить(-Инд);
				КонецЕсли;
			КонецЦикла;		
					
			Если СтрокиПогашенияСозданныеНаСервере.Количество() = 0 Тогда
			
				НоваяСтрокаПогашенияПлановыеНаСервере = ПогашенияПлановыеНаСервере.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПогашенияПлановыеНаСервере, СтрокаПлановыеПогашения);
				
			Иначе
				
				СтрокаПогашенияСозданныеНаСервере = СтрокиПогашенияСозданныеНаСервере[СтрокиПогашенияСозданныеНаСервере.Количество() - 1];
				СтрокаПогашенияСозданныеНаСервере.ПлановоеКоличество  = СтрокаПогашенияСозданныеНаСервере.ПлановоеКоличество + СтрокаПлановыеПогашения.Количество;
				СтрокаПогашенияСозданныеНаСервере.ПлановаяСумма       = СтрокаПогашенияСозданныеНаСервере.ПлановаяСумма + СтрокаПлановыеПогашения.Сумма;
				СтрокаПогашенияСозданныеНаСервере.ПлановаяСуммаКупона = СтрокаПогашенияСозданныеНаСервере.ПлановаяСуммаКупона + СтрокаПлановыеПогашения.СуммаКупона;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ПогашенияПлановыеНаСервере, "ПогашенияПлановые");
						
	КонецЕсли;
	
	ПогашенияСозданныеНаСервере.Строки.Сортировать("ИсключатьИзРасчетов, Объект");
	
	ЗначениеВРеквизитФормы(ПогашенияСозданныеНаСервере, "ПогашенияСозданные");
	
КонецФункции // ЗаполнитьПлановыеПогашенияНаСервере

&НаСервере
Функция ЗаполнитьПлановыеИСозданныеПогашенияНаСервере()
	
	ЗаполнитьСозданныеПогашенияОблигацииНаСервере();
	
	ЗаполнитьПлановыеПогашенияНаСервере();		
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	ОбновитьНадписьПогашенияПлановыеИтого(ЭтаФорма);
	
КонецФункции // ЗаполнитьПлановыеИСозданныеПогашенияНаСервере

&НаКлиентеНаСервереБезКонтекста
Функция НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;
		
	Если      Форма.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.ПолноеПогашение") Тогда
		
		Элементы.Дата.РежимВыбораИзСписка = Ложь;
		Элементы.Дата.ТолькоПросмотр      = Истина;
		
	ИначеЕсли Форма.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.Оферта") Тогда
		
		Элементы.Дата.РежимВыбораИзСписка = Истина;
		Элементы.Дата.ТолькоПросмотр      = Ложь;
		
	ИначеЕсли Форма.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.ЧастичноеПогашение") Тогда
		
		Элементы.Дата.РежимВыбораИзСписка = Истина;
		Элементы.Дата.ТолькоПросмотр      = Ложь;

	КонецЕсли;
	
	ЕстьРасхожденияПоКоличество  = Ложь;
	ЕстьРасхожденияПоСумма       = Ложь;
	ЕстьРасхожденияПоСуммаКупона = Ложь;
	
	Для каждого Строка1ПогашенияСозданные Из Форма.ПогашенияСозданные.ПолучитьЭлементы() Цикл
		
		Если Строка1ПогашенияСозданные.ИсключатьИзРасчетов Тогда
			Продолжить;
		КонецЕсли;
		
		Строка1ПогашенияСозданные._ПлановоеКоличество  = " (" + Строка1ПогашенияСозданные.ПлановоеКоличество + ")";
		Строка1ПогашенияСозданные._ПлановаяСумма       = " (" + Строка1ПогашенияСозданные.ПлановаяСумма + ")";
		Строка1ПогашенияСозданные._ПлановаяСуммаКупона = " (" + Строка1ПогашенияСозданные.ПлановаяСуммаКупона + ")";
		
		Строка1ПогашенияСозданные.РасхождениеПоКоличество  = (Строка1ПогашенияСозданные.Количество  <> Строка1ПогашенияСозданные.ПлановоеКоличество);
		Строка1ПогашенияСозданные.РасхождениеПоСумма       = (Строка1ПогашенияСозданные.Сумма       <> Строка1ПогашенияСозданные.ПлановаяСумма);
		Строка1ПогашенияСозданные.РасхождениеПоСуммаКупона = (Строка1ПогашенияСозданные.СуммаКупона <> Строка1ПогашенияСозданные.ПлановаяСуммаКупона);
		
		Если Не ЕстьРасхожденияПоКоличество И Строка1ПогашенияСозданные.РасхождениеПоКоличество Тогда
			ЕстьРасхожденияПоКоличество = Истина;
		КонецЕсли;

		Если Не ЕстьРасхожденияПоСумма И Строка1ПогашенияСозданные.РасхождениеПоСумма Тогда
			ЕстьРасхожденияПоСумма = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ПогашенияСозданные_ПлановоеКоличество.Видимость  = ЕстьРасхожденияПоКоличество;
	Элементы.ПогашенияСозданные_ПлановаяСумма.Видимость       = ЕстьРасхожденияПоСумма;
	Элементы.ПогашенияСозданные_ПлановаяСуммаКупона.Видимость = ЕстьРасхожденияПоСуммаКупона;
	
	Элементы.СуммаКупонаНаОднуОблигацию.Видимость = Не (Форма.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.ЧастичноеПогашение"));
	
	Элементы.СуммаНаОднуОблигацию.ТолькоПросмотр = Не (Форма.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.Оферта"));
	
КонецФункции // НастроитьВидимостьИДоступность

&НаКлиенте
Функция ПолучитьДанныеВыбранныхДокументов()
	
	ДанныеВыбранныхДокументов = Новый Массив;
	
	ВыделенныеСтрокиСписка = Элементы.ПогашенияСозданные.ВыделенныеСтроки;
	
	Если ВыделенныеСтрокиСписка = Неопределено Тогда
		Возврат ДанныеВыбранныхДокументов;
	КонецЕсли;
	
	Если ВыделенныеСтрокиСписка.Количество() = 0 Тогда
		Возврат ДанныеВыбранныхДокументов;
	КонецЕсли;	
	
	Для каждого ВыделеннаяСтрокаСписка Из ВыделенныеСтрокиСписка Цикл
		
		ДанныеВыделеннойСтрокиСписка = Элементы.ПогашенияСозданные.ДанныеСтроки(ВыделеннаяСтрокаСписка);
		
		Состояние = Неопределено;
		
		Если      ДанныеВыделеннойСтрокиСписка.СостояниеДокумента = 0 Тогда
			Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.ПомеченНаУдаление");
		ИначеЕсли ДанныеВыделеннойСтрокиСписка.СостояниеДокумента = 1 Тогда
			Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.Проведен");
		ИначеЕсли ДанныеВыделеннойСтрокиСписка.СостояниеДокумента = 2 Тогда
			Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.Записан");
		КонецЕсли;
		
		ДанныеВыбранныхДокументов.Добавить(
			Новый Структура("Документ, Состояние", ДанныеВыделеннойСтрокиСписка.Документ, Состояние));
		
	КонецЦикла;

	Возврат ДанныеВыбранныхДокументов;
	
КонецФункции // ПолучитьДанныеВыбранныхДокументов

&НаКлиенте
Процедура ПечатьПоручения(тип,Брокер)
	ПараметрыОбработки=новый Структура;
	ПараметрыОбработки.Вставить("Брокер",Брокер);
	ПараметрыОбработки.Вставить("Организация",Организация);
	ПараметрыОбработки.Вставить("ДатаОферты",Дата);
	ПараметрыОбработки.Вставить("ЦеннаяБумага",Облигация);
	ПараметрыОбработки.Вставить("Тип",Тип);
	
	
	
	ПараметрыОбработки.Вставить("ПогашенияПлановые",ПогашенияПлановые);
	
	
	ОткрытьФорму("Обработка.ПечатьОферт.Форма.Форма",ПараметрыОбработки,ЭтаФорма);

КонецПроцедуры

#КонецОбласти
